export const timeSlots = [
  "১০:০০ - ১০:৪০",
  "১০:৪০ - ১১:২০",
  "১১:২০ - ১২:০০",
  "১২:০০ - ১২:৪০",
  "১২:৪০ - ১:২০",
];

export const scheduleData: Record<string, any> = {
  রবিবার: {
    বিজ্ঞান: {
      একাদশ: ["ইংরেজি", "রসায়ন", "তথ্য প্রযুক্তি", "গণিত", "জীববিজ্ঞান"],
      দ্বাদশ: ["গণিত", "জীববিজ্ঞান", "ইংরেজি", "রসায়ন", "বাংলা"],
    },
    মানবিক: {
      একাদশ: ["ইংরেজি", "পৌরনীতি", "তথ্য প্রযুক্তি", "সমাজবিজ্ঞান", "অর্থনীতি"],
      দ্বাদশ: ["অর্থনীতি", "সমাজবিজ্ঞান", "ইংরেজি", "পৌরনীতি", "বাংলা"],
    },
    "ব্যবসায় শিক্ষা": {
      একাদশ: [
        "ইংরেজি",
        "হিসাববিজ্ঞান",
        "তথ্য প্রযুক্তি",
        "উৎপাদন",
        "ব্যবস্থাপনা",
      ],
      দ্বাদশ: ["ব্যবস্থাপনা", "উৎপাদন", "ইংরেজি", "হিসাববিজ্ঞান", "বাংলা"],
    },
  },
  সোমবার: {
    বিজ্ঞান: {
      একাদশ: ["বাংলা", "গণিত", "পদার্থ", "জীববিজ্ঞান", "ইংরেজি"],
      দ্বাদশ: ["জীববিজ্ঞান", "রসায়ন", "জীব ব্যব:", "তথ্য প্রযুক্তি", "পদার্থ"],
    },
    মানবিক: {
      একাদশ: ["বাংলা", "অর্থনীতি", "কৃষি/মনোবিজ্ঞান", "সমাজবিজ্ঞান", "ইংরেজি"],
      দ্বাদশ: [
        "ইতি/ইস:ইতি",
        "যুক্তিবিদ্যা",
        "পৌরনীতি",
        "তথ্য প্রযুক্তি",
        "কৃষি/মনোবিজ্ঞান",
      ],
    },
    "ব্যবসায় শিক্ষা": {
      একাদশ: [
        "বাংলা",
        "ব্যবস্থাপনা",
        "কৃষি/মনোবিজ্ঞান",
        "",
        "হিসাববিজ্ঞান",
        "ইংরেজি",
      ],
      দ্বাদশ: [
        "উৎপাদন",
        "হিসাববিজ্ঞান",
        "ব্যবস্থাপনা",
        "তথ্য প্রযুক্তি",
        "কৃষি/মনোবিজ্ঞান",
      ],
    },
  },
  মঙ্গলবার: {
    বিজ্ঞান: {
      একাদশ: ["পদার্থ", "জীববিজ্ঞান", "রসায়ন ব্যব: ", "জীব ব্যব: ", "বাংলা"],
      দ্বাদশ: ["রসায়ন", "বাংলা", "ইংরেজি", "পদার্থ", "গণিত"],
    },
    মানবিক: {
      একাদশ: [
        "পৌরনীতি",
        "কৃষি/মনোবিজ্ঞান",
        "ইতি/ইস:ইতি",
        "যুক্তিবিদ্যা",
        "বাংলা",
      ],
      দ্বাদশ: ["যুক্তিবিদ্যা", "বাংলা", "ইংরেজি", "অর্থনীতি", "অর্থনীতি"],
    },
    "ব্যবসায় শিক্ষা": {
      একাদশ: ["উৎপাদন", "কৃষি/মনোবিজ্ঞান", "---", "---", "বাংলা"],
      দ্বাদশ: ["হিসাববিজ্ঞান", "বাংলা", "ইংরেজি", "উৎপাদন", "ব্যবস্থাপনা"],
    },
  },
  বুধবার: {
    বিজ্ঞান: {
      একাদশ: ["রসায়ন", "ইংরেজি", "---", "পদার্থ", "জীব ব্যব:"],
      দ্বাদশ: [
        "তথ্য প্রযুক্তি",
        "জীববিজ্ঞান",
        "বাংলা",
        "রসায়ন ব্যব:",
        "ইংরেজি",
      ],
    },
    মানবিক: {
      একাদশ: [
        "সমাজবিজ্ঞান",
        "ইংরেজি",
        "যুক্তিবিদ্যা",
        "অর্থনীতি",
        "কৃষি/মনোবিজ্ঞান",
        "ইতি/ইস:ইতি",
      ],
      দ্বাদশ: [
        "তথ্য প্রযুক্তি",
        "অর্থনীতি",
        "বাংলা",
        "কৃষি/মনোবিজ্ঞান",
        "ইংরেজি",
      ],
    },
    "ব্যবসায় শিক্ষা": {
      একাদশ: ["ব্যবস্থাপনা", "ইংরেজি", "---", "---", "---"],
      দ্বাদশ: [
        "তথ্য প্রযুক্তি",
        "ব্যবস্থাপনা",
        "বাংলা",
        "কৃষি/মনোবিজ্ঞান ",
        "ইংরেজি",
      ],
    },
  },
  বৃহস্পতিবার: {
    বিজ্ঞান: {
      একাদশ: ["তথ্য প্রযুক্তি", "গণিত", "---", "জীব ব্যব:", "---"],
      দ্বাদশ: ["---", "রসায়ন ব্যব:", "তথ্য প্রযুক্তি", "গণিত", "পদার্থ"],
    },
    মানবিক: {
      একাদশ: [
        "তথ্য প্রযুক্তি",
        "কৃষি/মনোবিজ্ঞান ",
        "পৌরনীতি",
        "ইতি/ইস:ইতি",
        "যুক্তিবিদ্যা",
      ],
      দ্বাদশ: [
        "যুক্তিবিদ্যা",
        "ইতি/ইস:ইতি",
        "তথ্য প্রযুক্তি",
        "কৃষি/মনোবিজ্ঞান",
        "পৌরনীতি",
      ],
    },
    "ব্যবসায় শিক্ষা": {
      একাদশ: [
        "তথ্য প্রযুক্তি",
        "কৃষি/মনোবিজ্ঞান ",
        "হিসাববিজ্ঞান",
        "---",
        "উৎপাদন",
      ],
      দ্বাদশ: [
        "হিসাববিজ্ঞান",
        "উৎপাদন",
        "তথ্য প্রযুক্তি",
        "কৃষি/মনোবিজ্ঞান",
        "---",
      ],
    },
  },
  শুক্রবার: {},
  শনিবার: {},
};

export const dayMap = [
  "রবিবার",
  "সোমবার",
  "মঙ্গলবার",
  "বুধবার",
  "বৃহস্পতিবার",
  "শুক্রবার",
  "শনিবার",
];

export const departments = ["বিজ্ঞান", "মানবিক", "ব্যবসায় শিক্ষা"];
export const grades = ["একাদশ", "দ্বাদশ"];
